# 数值计算
echo '$((1 + 1))' == "$((1 + 1))" # it will be `2'
echo '$((2 - 1))' == "$((2 - 1))" # it will be `1'
echo '$((2 * 2))' == "$((2 * 2))" # it will be `4'
echo '$((6 / 3))' == "$((6 / 3))" # it will be `2'
# 数值计数 ---------------------------------

# 数值比较 ---------------------------------
# [[ ]],  [ ] 中表达式必须与中括号 用空格隔开
# 双中括号可以用比较符 ( == != > < >= <= ) 和逻辑符 ( || && )
if [[ 2 > 1 ]]; then echo yes; fi          # 直接比较
if [[ $[ 4 / 2 ] > 1 ]]; then echo yes; fi # 计算比较
if [[ 1024 == 1024 ]]; then echo yes; fi # 布尔表达式

# 单中括号只能使用比较参 -eq -ne -gt -lt -ge -le 和逻辑参 ( -o -a )
# -o 表示 ||
# -a 表示 &&
if [ 2 -gt 1 ]; then echo yes; fi
if [ $[ 4 / 2 ] -gt 1 ]; then echo yes; fi
if [ 2048 -ne 1024 ]; then echo yes; fi
# 数值比较 ---------------------------------